## REST Payload to DB Table

Let us perform an exercise to get the REST Payload into a database table.
* REST API URL: https://gbfs.citibikenyc.com/gbfs/en/station_information.json
* Database Name: **{username}_sms_db**
* First Table Name: **stations**
* Create table for following fields. Make sure to use appropriate data types
  * id - Sequence generated primary key
  * station_id - Uniqueness needs to be enforced.
  * station_type
  * name
  * short_name
  * capacity
  * external_id
  * has_kiosk
  * legacy_id
  * region_id
  * electric_bike_surcharge_waiver
  * eightd_station_services
* Get the data from the REST payload into the table **stations** created.
* Run queries for following scenarios.
  * Get distinct station types.
  * Get number of stations per region_id.
  * Get top 10 stations by capacity.
  * Get number of stations where there are no kiosks.
* Second Table Name: **station_rental_types**
* Create table with following fields
  * station_id
  * rental_type - the source field is of type list. The target column in the table should be of type VARCHAR.
  * station_rental_type_id - sequence generated primary key.
  * Combination of station_id and rental_type is supposed to be unique.
* For all station ids where there is one or more rental_types, the data should be inserted into the table separately with rental_type.
* Sample input record `{'station_id': 1, 'rental_types': ['KEY', 'CREDIT CARD]}`
* Sample data in the table

|station_id|rental_type|
|---|---|
|1|KEY|
|1|CREDIT CARD|

* Run queries for following scenarios.
  * Get number of records from **station_rental_types**
  * Get number of stations where rental_type is **KEY**
  * Get number of stations where rental_type is **CREDIT CARD**
  * Get number stations by rental_type.
  * Get the stations where there is no rental type.

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
%env DATABASE_URL=postgresql://itv001243_sms_user:password@m01.itversity.com:5433/itv001243_sms_db

In [6]:
%sql DROP TABLE IF EXISTS stations

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
Done.

[]

In [7]:
%%sql

CREATE TABLE stations(
    id  SERIAL PRIMARY KEY,
    station_id INT NOT NULL UNIQUE,
    station_type VARCHAR(100),
    name VARCHAR(80),
    short_name VARCHAR(50),
    capacity INT,
    external_id VARCHAR(90),
    has_kiosk BOOLEAN,
    legacy_id VARCHAR(50),
    region_id VARCHAR(50),
    electric_bike_surcharge_waiver BOOLEAN,
    eightd_station_services VARCHAR ARRAY
)

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
Done.

[]

In [8]:
import requests, json, psycopg2  
payloads =  requests.get('https://gbfs.citibikenyc.com/gbfs/en/station_information.json').json()
conn = psycopg2.connect(user="itv001243_sms_user",
                                password="password",
                                host="m01.itversity.com",
                                port="5433",
                                database="itv001243_sms_db")

cursor = conn.cursor()

payloads['data']['stations'][0]

d=list(map(lambda a: (int(a['station_id']),a['station_type'],a['name'],
                      a['short_name'],a['capacity'],a['external_id'],a['has_kiosk'],
                      a['legacy_id'],a['region_id'],a['electric_bike_surcharge_waiver'],
                      a['eightd_station_services']),payloads['data']['stations']))

query = ("""INSERT into stations
    (station_id,station_type,name,short_name,capacity,external_id,
    has_kiosk,legacy_id,region_id,electric_bike_surcharge_waiver,
    eightd_station_services) 
    VALUES
    (%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)""")

cursor.executemany(query, d)

conn.commit()

cursor.close()
conn.close()

In [9]:
d[0]

(72,
 'classic',
 'W 52 St & 11 Ave',
 '6926.01',
 55,
 '66db237e-0aca-11e7-82f6-3863bb44ef7c',
 True,
 '72',
 '71',
 False,
 [])

In [10]:
%%sql

select * from stations
limit 10

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
10 rows affected.

[(1, 72, 'classic', 'W 52 St & 11 Ave', '6926.01', 55, '66db237e-0aca-11e7-82f6-3863bb44ef7c', True, '72', '71', False, []),
 (2, 79, 'classic', 'Franklin St & W Broadway', '5430.08', 33, '66db269c-0aca-11e7-82f6-3863bb44ef7c', True, '79', '71', False, []),
 (3, 82, 'classic', 'St James Pl & Pearl St', '5167.06', 27, '66db277a-0aca-11e7-82f6-3863bb44ef7c', True, '82', '71', False, []),
 (4, 83, 'classic', 'Atlantic Ave & Fort Greene Pl', '4354.07', 62, '66db281e-0aca-11e7-82f6-3863bb44ef7c', True, '83', '71', False, []),
 (5, 116, 'classic', 'W 17 St & 8 Ave', '6148.02', 50, '66db28b5-0aca-11e7-82f6-3863bb44ef7c', True, '116', '71', False, []),
 (6, 119, 'classic', 'Park Ave & St Edwards St', '4700.06', 53, '66db2953-0aca-11e7-82f6-3863bb44ef7c', True, '119', '71', False, []),
 (7, 120, 'classic', 'Lexington Ave & Classon Ave', '4452.03', 19, '66db29e6-0aca-11e7-82f6-3863bb44ef7c', True, '120', '71', False, []),
 (8, 127, 'classic', 'Barrow St & Hudson St', '5805.05', 31, '66db2a71-0aca-11e7-82f6-3863bb44ef7c', True, '127', '71', False, []),
 (9, 128, 'classic', 'MacDougal St & Prince St', '5687.04', 56, '66db2afe-0aca-11e7-82f6-3863bb44ef7c', True, '128', '71', False, []),
 (10, 143, 'classic', 'Clinton St & Joralemon St', '4605.04', 50, '66db2d2b-0aca-11e7-82f6-3863bb44ef7c', True, '143', '71', False, [])]

#### Get distinct station types

In [11]:
%sql SELECT DISTINCT station_type FROM stations

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
1 rows affected.

[('classic',)]

#### Get number of stations per region_id

In [12]:
%%sql 

SELECT region_id,count(station_id) AS number_of_stations_per_region_id FROM stations
GROUP BY region_id

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
3 rows affected.

[('311', 28), ('71', 1540), ('70', 53)]

#### Get top 10 stations by capacity.

In [13]:
%%sql 

SELECT * FROM stations
GROUP BY capacity,ID
ORDER BY capacity DESC
LIMIT 10

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
10 rows affected.

[(176, 445, 'classic', 'E 10 St & Avenue A', '5659.05', 107, '66dc1beb-0aca-11e7-82f6-3863bb44ef7c', True, '445', '71', False, []),
 (38, 248, 'classic', 'Laight St & Hudson St', '5539.06', 91, '66db402c-0aca-11e7-82f6-3863bb44ef7c', True, '248', '71', False, []),
 (64, 293, 'classic', 'Lafayette St & E 8 St', '5788.13', 91, '66db65aa-0aca-11e7-82f6-3863bb44ef7c', True, '293', '71', False, []),
 (1580, 4675, 'classic', 'E 40 St & Park Ave', '6432.11', 87, 'c638ec67-9ac0-416f-944f-619926144931', True, '4675', '71', False, []),
 (195, 470, 'classic', 'W 20 St & 8 Ave', '6224.05', 84, '66dc36c3-0aca-11e7-82f6-3863bb44ef7c', True, '470', '71', False, []),
 (728, 3687, 'classic', 'E 33 St & 1 Ave', '6197.08', 83, '61c82689-3f4c-495d-8f44-e71de8f04088', True, '3687', '71', False, []),
 (219, 501, 'classic', 'FDR Drive & E 35 St', '6230.04', 83, '66dc7659-0aca-11e7-82f6-3863bb44ef7c', True, '501', '71', False, []),
 (132, 386, 'classic', 'Centre St & Worth St', '5279.03', 82, '66dbe848-0aca-11e7-82f6-3863bb44ef7c', True, '386', '71', False, []),
 (163, 426, 'classic', 'West St & Chambers St', '5329.03', 81, '66dc0e99-0aca-11e7-82f6-3863bb44ef7c', True, '426', '71', False, []),
 (1342, 4406, 'classic', 'E 11 St & 3 Ave', '5788.16', 80, 'a4368364-fa79-493c-8478-1d3471a6077f', True, '4406', '71', False, [])]

#### Get number of stations where there are no kiosks

In [14]:
%%sql 

SELECT count(station_id) FROM stations
WHERE has_kiosk IN ('True')

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
1 rows affected.

[(1615,)]

In [16]:
import requests

In [17]:
payload =  requests.get('https://gbfs.citibikenyc.com/gbfs/en/station_information.json').content.decode('utf-8')

In [18]:
payload =  requests.get('https://gbfs.citibikenyc.com/gbfs/en/station_information.json').json()

In [20]:
payload['data']['stations'][0]['external_id']

'66db237e-0aca-11e7-82f6-3863bb44ef7c'

In [21]:
payload['data']['stations'][0]

{'region_id': '71',
 'rental_methods': ['CREDITCARD', 'KEY'],
 'external_id': '66db237e-0aca-11e7-82f6-3863bb44ef7c',
 'station_id': '72',
 'has_kiosk': True,
 'lat': 40.76727216,
 'electric_bike_surcharge_waiver': False,
 'eightd_has_key_dispenser': False,
 'name': 'W 52 St & 11 Ave',
 'legacy_id': '72',
 'station_type': 'classic',
 'lon': -73.99392888,
 'rental_uris': {'ios': 'https://bkn.lft.to/lastmile_qr_scan',
  'android': 'https://bkn.lft.to/lastmile_qr_scan'},
 'short_name': '6926.01',
 'eightd_station_services': [],
 'capacity': 55}

In [25]:
d[0]

(72,
 'classic',
 'W 52 St & 11 Ave',
 '6926.01',
 55,
 '66db237e-0aca-11e7-82f6-3863bb44ef7c',
 True,
 '72',
 '71',
 False,
 [])

In [26]:
import pandas as pd

In [27]:
payload_pd = pd.DataFrame(payload)

In [28]:
payload_pd

                                                       data  last_updated  ttl
stations  [{'region_id': '71', 'rental_methods': ['CREDI...    1646630330    5

In [30]:
%sql DROP TABLE IF EXISTS station_rental_types

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
Done.

[]

In [31]:
%%sql

CREATE TABLE station_rental_types(
        station_rental_type_id SERIAL PRIMARY KEY,
        station_id VARCHAR(60),
        rental_type VARCHAR(60),
        station_id_rental_type VARCHAR(60) NOT NULL UNIQUE
)

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
Done.

[]

In [32]:
payloads['data']['stations'][0]['rental_methods']

['CREDITCARD', 'KEY']

In [33]:
payloads['data']['stations'][0]['station_id']

'72'

In [34]:
station_rental_types= list(map( lambda a: {'station_id': a['station_id'],
                                           'rental_types':a['rental_methods']},
                               payloads['data']['stations']))

In [35]:
station_rental_types[1]

{'station_id': '79', 'rental_types': ['CREDITCARD', 'KEY']}

In [36]:
import pandas as pd 
b=pd.DataFrame.from_dict(station_rental_types)
b.head()
new =b.explode('rental_types')
new

     station_id rental_types
0            72   CREDITCARD
0            72          KEY
1            79   CREDITCARD
1            79          KEY
2            82   CREDITCARD
...         ...          ...
1618       4732          KEY
1619       4738   CREDITCARD
1619       4738          KEY
1620       4739   CREDITCARD
1620       4739          KEY

[3242 rows x 2 columns]

In [37]:
new['station_id_rental_type'] = new['station_id']+ " "+new['rental_types']

In [36]:
new_df =[tuple(i) for i in new.values]

In [42]:
import requests, json, psycopg2  
payloads =  requests.get('https://gbfs.citibikenyc.com/gbfs/en/station_information.json').json()
conn = psycopg2.connect(user="itv001243_sms_user",
                                password="password",
                                host="m01.itversity.com",
                                port="5433",
                                database="itv001243_sms_db")

cursor = conn.cursor()


query = ("""INSERT into station_rental_types
    (station_id,rental_type,station_id_rental_type) 
    VALUES
    (%s,%s,%s)""")

 
cursor.executemany(query,new_df)

conn.commit()

cursor.close()

In [44]:
%sql SELECT * FROM station_rental_types limit 10

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
10 rows affected.

[(1, '72', 'KEY', '72 KEY'),
 (2, '72', 'CREDITCARD', '72 CREDITCARD'),
 (3, '79', 'KEY', '79 KEY'),
 (4, '79', 'CREDITCARD', '79 CREDITCARD'),
 (5, '82', 'KEY', '82 KEY'),
 (6, '82', 'CREDITCARD', '82 CREDITCARD'),
 (7, '83', 'KEY', '83 KEY'),
 (8, '83', 'CREDITCARD', '83 CREDITCARD'),
 (9, '116', 'KEY', '116 KEY'),
 (10, '116', 'CREDITCARD', '116 CREDITCARD')]

* Run queries for following scenarios.
  * Get number of records from **station_rental_types**
  * Get number of stations where rental_type is **KEY**
  * Get number of stations where rental_type is **CREDIT CARD**
  * Get number stations by rental_type.
  * Get the stations where there is no rental type.

#### Get number of records from station_rental_types

In [45]:
%%sql

SELECT count(station_rental_type_id) FROM station_rental_types

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
1 rows affected.

[(3240,)]

#### Get number of stations where rental_type is KEY

In [47]:
%%sql

SELECT count(station_rental_type_id) FROM station_rental_types
WHERE rental_type = 'KEY'

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
1 rows affected.

[(1620,)]

#### Get number of stations where rental_type is CREDIT CARD

In [49]:
%%sql

SELECT count(station_rental_type_id) FROM station_rental_types
WHERE rental_type = 'CREDITCARD'

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
1 rows affected.

[(1620,)]

#### Get number stations by rental_type

In [52]:
%%sql

SELECT rental_type,count(station_rental_type_id) FROM station_rental_types
GROUP BY rental_type

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
2 rows affected.

[('CREDITCARD', 1620), ('KEY', 1620)]

#### Get the stations where there is no rental type.

In [56]:
%%sql

SELECT * FROM station_rental_types
WHERE rental_type = null

 * postgresql://itv001243_sms_user:***@m01.itversity.com:5433/itv001243_sms_db
0 rows affected.

[]